Revit 2027 API
BuiltInFailures.ElementTypeFailures Class
 Failures about ElementTypeFailures.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElementTypeFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ElementTypeFailures
Public NotInheritable Class ElementTypeFailures
public ref class ElementTypeFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElementTypeFailures = class end
The BuiltInFailures.ElementTypeFailures type exposes the following members.
Properties
Name | Description
NoDefaultType |  As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.
WarnLastType1 |  Last type in system family '[Name]' cannot be deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace